{
  "architectures": [
    "LlamaForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "bos_token_id": 128000,
  "dtype": "bfloat16",
  "eos_token_id": 128001,
  "head_dim": 128,
  "hidden_act": "silu",
  "hidden_size": 4096,
  "initializer_range": 0.02,
  "intermediate_size": 14336,
  "max_position_embeddings": 8192,
  "mlp_bias": false,
  "model_type": "llama",
  "num_attention_heads": 32,
  "num_hidden_layers": 32,
  "num_key_value_heads": 8,
  "pad_token_id": null,
  "pretraining_tp": 1,
  "quantization_config": {
    "algo_config": null,
    "exclude": [
      "lm_head"
    ],
    "export": {
      "kv_cache_group": [],
      "min_kv_scale": 0.0,
      "pack_method": "reorder",
      "weight_format": "real_quantized",
      "weight_merge_groups": null
    },
    "global_quant_config": {
      "bias": null,
      "input_tensors": null,
      "output_tensors": null,
      "target_device": null,
      "weight": {
        "ch_axis": -1,
        "dtype": "int4",
        "group_size": 128,
        "is_dynamic": false,
        "is_scale_quant": false,
        "mx_element_dtype": null,
        "observer_cls": "PerGroupMinMaxObserver",
        "qscheme": "per_group",
        "round_method": "half_even",
        "scale_calculation_mode": null,
        "scale_format": null,
        "scale_type": "float",
        "symmetric": true
      }
    },
    "kv_cache_post_rope": false,
    "kv_cache_quant_config": {},
    "layer_quant_config": {},
    "layer_type_quant_config": {},
    "quant_method": "quark",
    "quant_mode": "eager_mode",
    "softmax_quant_spec": null,
    "version": "0.11.1+unknown"
  },
  "rms_norm_eps": 1e-05,
  "rope_parameters": {
    "rope_theta": 500000.0,
    "rope_type": "default"
  },
  "tie_word_embeddings": false,
  "transformers_version": "5.2.0",
  "use_cache": true,
  "vocab_size": 128256
}
